[
  {
    "desc": "Develops software applications for both client-side and server-side systems, working with various programming languages, frameworks, and databases.",
    "category": "Full-stack Software Engineer"
  },
  {
    "desc": "Designs and develops the back-end of software applications, which include databases, servers, APIs, and other back-end systems.",
    "category": "Backend Software Engineer"
  },
  {
    "desc": "Designs and develops the front-end of software applications, including the user interface, interactions, and user experience.",
    "category": "Front-end Software Engineer"
  },
  {
    "desc": "Develops software applications for mobile devices such as smartphones and tablets, using mobile-specific technologies such as iOS or Android.",
    "category": "Mobile Software Engineer"
  },
  {
    "desc": "Responsible for the development and maintenance of the infrastructure and tools used for software development and deployment, such as continuous integration and delivery systems.",
    "category": "DevOps Engineer"
  },
  {
    "desc": "Develops and maintains the infrastructure and systems that handle large volumes of data, including data storage, processing, and analysis.",
    "category": "Data Engineer"
  },
  {
    "desc": "Develops and maintains cloud-based systems, such as infrastructure as a service (IaaS), platform as a service (PaaS), and software as a service (SaaS).",
    "category": "Cloud Engineer"
  },
  {
    "desc": "Develops and implements security measures to protect software applications and systems from cyber threats, including hacking, malware, and other attacks.",
    "category": "Security Engineer"
  },
  {
    "desc": "Develops and implements machine learning algorithms and systems, including natural language processing, computer vision, and other artificial intelligence applications.",
    "category": "Machine Learning Engineer"
  },
  {
    "desc": "Responsible for ensuring the quality of software applications through various testing methods and processes, including manual and automated testing, code reviews, and bug fixing",
    "category": "QA Engineer"
  },
  {
    "desc": "Develops software for embedded systems, which are computing systems that are integrated into other devices or equipment, such as cars, medical devices, or industrial machines.",
    "category": "Embedded Software Engineer"
  },
  {
    "desc": "Develops video games, using programming languages and game development tools, such as Unity or Unreal Engine.",
    "category": "Game Developer"
  },
  {
    "desc": "Designs the user interface and user experience of software applications, using principles of user-centered design and visual design.",
    "category": "UI/UX Designer"
  },
  {
    "desc": "Maintains and manages the computer systems and servers that run software applications, including software installation, security updates, and backup and recovery.",
    "category": "System Administrator"
  },
  {
    "desc": "Oversees the development of software products, working with engineers, designers, and other stakeholders to define requirements, prioritize features, and manage the product roadmap.",
    "category": "Product Manager"
  },
  {
    "desc": "We are seeking a highly skilled software developer to design and develop software applications for our clients. The ideal candidate should have experience with programming languages such as Java or C++, and familiarity with software development methodologies such as Agile or Scrum.
",
    "category": "Software developer"
  },
  {
    "desc": "We are looking for a software developer with experience in Java or C++ to join our team. The ideal candidate should be able to design and develop software applications and have experience with Agile or Scrum methodologies.
",
    "category": "Software developer"
  },
  {
    "desc": "We are seeking a software engineer to join our team and help develop new features for our mobile app. The ideal candidate has experience with Java and Swift, and is familiar with Agile methodologies.
",
    "category": "Software engineer"
  },
  {
    "desc": "We are looking for a UX designer to create intuitive and engaging interfaces for our web and mobile applications. The ideal candidate has experience with user research, wireframing, and prototyping, and is familiar with design tools such as Sketch and Figma.
",
    "category": "UI/UX Designer"
  },
  {
    "desc": " Building cleaner  m f d  with journeyman qualification Your tasks: You will work full-time in the area of  basic and special cleaning You will lead a squad in the job areas assigned to you, coordinate the processes on site and set a good example yourself You operate the company s own and rented machines for basic and special cleaning Your qualifications: You have completed training as a building cleaner  m f d You have a category B driver s license  car You have an orderly and structured way of working You have a good command of spoken and written German What she expects: A successful family business operating throughout Germany with a long tradition, your area of  operation is limited to the catchment area of  the Cottbus branch  max. 1 hour travel time to the order office Fair and punctual payment according to the collective agreement A permanent employment contract A good compatibility of family and work, you spend your free time at home - no assembly work State-of-the-art cleaning material and professional work clothing.",
    "category": "Cleaner"
  },
  {
    "desc": " Cleaning staff  m f d Your tasks: They are in action in the district of Petershagen As a cleaner  m f d  you will work for different customers and in different objects They work in cleaning and take care of the environmentally friendly waste disposal and refill used materials Your qualifications: You are a career changer  m f d  or already have experience in building cleaning Among other things, you are characterized by your punctuality They have a friendly demeanor and a well-groomed appearance You have an orderly and structured way of working What she expects: A successful family business operating throughout Germany with a long tradition State-of-the-art cleaning material and professional work clothing Supervision by our property manager  m f d A pleasant working atmosphere.",
    "category": "Cleaner"
  },
  {
    "desc": " For our office we are looking for office assistants  m f d  for general office work at the earliest possible date. Job description: Your tasks will include order processing, supplier and customer support, telephone service, general office work, invoice verification, data entry and entry, correspondence. Job requirement:  Very good knowledge of German  Arabic as mother tongue or at least C1  Good knowledge of MS Office programs and e-mail, confident handling of computers and telephone  Ability to work independently  Your special skills include flexibility and a sense of responsibility. We look forward to receiving your application. We ask interested parties to send their application documents  curriculum vitae in tabular form, certificates  by e-mail or copies without folders by post.",
    "category": "Administrator"
  },
  ]